old_projects/MovingWalls/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 
FoamFile
{
    version         2.0;
    format          ascii;
 
    root            "";
    case            "";
    instance        "";
    local           "";
 
    class           dictionary;
    object          blockMeshDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
scale 1;
 
vertices
(

(0 0 0)//0
(5 0 0)//1
(5 1 0)//2
(0 1 0)//3

(0 0 1)//4
(5 0 1)//5
(5 1 1)//6
(0 1 1)//7
);
 
blocks
(
hex (0 1 2 3 4 5 6 7) (780  200 1) simpleGrading (1 200 1)
);
 
edges
(
);
 
boundary
(
    	Wall
    {
        type wall;
        faces
        (
                (3 2 6 7)
        );
    }
	movingWall
    {
        type wall;
        faces
        (
                (0 4 5 1)
        );
    }
	right
     { 
	   type cyclic;
	   neighbourPatch left;
           faces  
           (
               (6 2 1 5)
           );
      }
	left
     { 
           type cyclic;
	   neighbourPatch right;
           faces  
           (
               (7 4 0 3)
           );
      }
	
    frontAndBack
    {
        type empty;
        faces
        (
            (7 6 5 4)
            (3 0 1 2)
        );
    }
);
 
mergePatchPairs
(
);


// ************************************************************************* //
