old_projects/MovingWalls/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          780;
        startFace       311020;
    }
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          780;
        startFace       311800;
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          200;
        startFace       312580;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (5 0 0);
    }
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          200;
        startFace       312780;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-5 0 0);
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          312000;
        startFace       312980;
    }
)

// ************************************************************************* //
